In [2]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

In [3]:
dframe = DataFrame(np.arange(12).reshape(3, 4), 
                   index = ['MH', 'JH', 'MP'],
                   columns = ['A', 'B', 'C', 'D'])

dframe

    A  B   C   D
MH  0  1   2   3
JH  4  5   6   7
MP  8  9  10  11

In [7]:
dframe.index.map(str.lower)

Index(['mh', 'jh', 'mp'], dtype='object')

In [8]:
dframe.index = dframe.index.map(str.lower)

In [9]:
dframe

    A  B   C   D
mh  0  1   2   3
jh  4  5   6   7
mp  8  9  10  11

In [10]:
dframe.rename(index = str.title, columns = str.lower)

    a  b   c   d
Mh  0  1   2   3
Jh  4  5   6   7
Mp  8  9  10  11

In [11]:
dframe

    A  B   C   D
mh  0  1   2   3
jh  4  5   6   7
mp  8  9  10  11

In [15]:
dframe

    A  B   C   D
mh  0  1   2   3
jh  4  5   6   7
mp  8  9  10  11

In [16]:
dframe.rename(index = {'mh' : 'MAHARASHTRA'},
              columns = {'A':'ALPHA'})

             ALPHA  B   C   D
MAHARASHTRA      0  1   2   3
jh               4  5   6   7
mp               8  9  10  11

In [17]:
dframe

    A  B   C   D
mh  0  1   2   3
jh  4  5   6   7
mp  8  9  10  11

In [18]:
dframe.rename(index = {'mh' : 'MAHARASHTRA'}, inplace = True)

In [19]:
dframe

             A  B   C   D
MAHARASHTRA  0  1   2   3
jh           4  5   6   7
mp           8  9  10  11